Revit 2017 API
ElectricalSystem.ApparentCurrentPhaseB Property
Returns the ApparentCurrentPhaseB value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public double ApparentCurrentPhaseB { get; }
Visual Basic
Public ReadOnly Property ApparentCurrentPhaseB As Double
	Get
Visual C++
public:
property double ApparentCurrentPhaseB {
	double get ();
}
Remarks
This property is used to retrieve the ApparentCurrentPhaseB value of the Electrical System.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace